app/controllers/proverbs_controller.rb

SELECT  "proverbs".* FROM "proverbs" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
 def random
    proverb = Proverb.order('RANDOM()').limit(1).first

SELECT "proverbs".* FROM "proverbs"
---
	def index
		render json: Proverb.all

INSERT INTO "proverbs" ("content", "meaning", "source", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
	def create
    proverb = Proverb.new(proverb_params)
    if proverb.save

SELECT  "proverbs".* FROM "proverbs" WHERE "proverbs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "proverbs" SET "like" = $1, "updated_at" = $2 WHERE "proverbs"."id" = $3  [["like", 1], ["updated_at", "2018-03-05 16:41:17.976742"], ["id", 1]]
---
	def update
		proverb = Proverb.find_by(id: params[:id])
		if proverb.update(proverb_params)